MONITOR_OBJECT_TYPE = {
    "OS": "操作系统",
    "Web": "网络",
    "Middleware": "中间件",
    "Database": "数据库",
    "K8S": "K8S",
    "Network Device": "网络设备",
    "Hardware Device": "硬件设备",
    "Container Management": "容器管理",
    "Other": "其他",
    "VMware": "VMware"
}

MONITOR_OBJECT = {
    "Host": "主机",
    "Website": "网站",
    "Ping": "Ping",
    "RabbitMQ": "RabbitMQ",
    "Nginx": "Nginx",
    "Apache": "Apache",
    "ClickHouse": "ClickHouse",
    "Consul": "Consul",
    "Tomcat": "Tomcat",
    "Zookeeper": "Zookeeper",
    "ActiveMQ": "ActiveMQ",
    "ElasticSearch": "ElasticSearch",
    "MongoDB": "MongoDB",
    "Mysql": "Mysql",
    "Postgres": "Postgres",
    "Redis": "Redis",
    "Switch": "交换机",
    "Router": "路由器",
    "Loadbalance": "负载均衡",
    "Firewall": "防火墙",
    "Detection Device": "检测设备",
    "Bastion Host": "堡垒机",
    "Scanning Device": "扫描设备",
    "Storage": "存储设备",
    "Hardware Server": "硬件服务器",
    "Docker": "Docker",
    "Docker Container": "Docker容器",
    "Cluster": "K8S集群",
    "Pod": "Pod",
    "Node": "Node",
    "SNMP Trap": "SNMP Trap",
    "vCenter": "vCenter",
    "ESXI": "ESXI",
    "VM": "虚拟机",
    "DataStorage": "数据存储"
}

MONITOR_OBJECT_PLUGIN = {
    "Host": {
        "name": "主机",
        "desc": "主机监控插件用于收集和分析主机的性能数据，包括CPU、内存、磁盘和网络使用情况"
    },
    "Website": {
        "name": "网站拨测",
        "desc": "网站拨测插件的作用是可以定期检查HTTP/HTTPS连接的可用性和性能"
    },
    "Ping": {
        "name": "Ping",
        "desc": "ping用于通过发送ICMP Echo请求（ping）来检查目标主机或网络设备的连通性和响应时间。"
    },
    "K8S": {
        "name": "K8S",
        "desc": "K8S监控插件用于监控Kubernetes集群的状态和健康，包括节点、容器和pod的性能指标"
    },
    "Switch SNMP General": {
        "name": "交换机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理交换机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Router SNMP General": {
        "name": "路由器通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理路由器的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Loadbalance SNMP General": {
        "name": "负载均衡通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理负载均衡的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Firewall SNMP General": {
        "name": "防火墙通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理防火墙的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Detection Device SNMP General": {
        "name": "检测设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理检测设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Bastion Host SNMP General": {
        "name": "堡垒机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理堡垒机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Scanning Device SNMP General": {
        "name": "扫描设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Storage SNMP General": {
        "name": "存储设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Storage IPMI": {
        "name": "存储设备通用（IPMI）",
        "desc": "IPMI监控插件与硬件通信，提供对系统健康状态、硬件传感器数据和电源管理的实时监控。"
    },
    "Hardware Server SNMP General": {
        "name": "硬件服务器通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Hardware Server IPMI": {
        "name": "硬件服务器通用（IPMI）",
        "desc": "IPMI监控插件与硬件通信，提供对系统健康状态、硬件传感器数据和电源管理的实时监控。"
    },
    "SNMP Trap": {
        "name": "SNMP Trap",
        "desc": "SNMP Trap监控插件用于接收和处理网络设备主动推送的报警或状态通知（Trap消息），以实现实时监控和故障告警。"
    },
    "Zookeeper": {
        "name": "Zookeeper",
        "desc": "通过采集Zookeeper运行时的性能数据和稳定性指标，如运行时长、平均延迟、读写比例等，帮助用户实时监控集群状态并优化性能。"
    },
    "Apache": {
        "name": "Apache",
        "desc": "实时采集Apache运行时间、资源使用情况、请求处理效率及带宽数据，帮助用户优化性能、诊断问题和实现高效运维管理。"
    },
    "ClickHouse": {
        "name": "ClickHouse",
        "desc": "采集ClickHouse实例运行时指标，如内存、磁盘、查询事件等，用于性能监控、资源跟踪及故障诊断，保障数据库稳定运行。"
    },
    "RabbitMQ": {
        "name": "RabbitMQ",
        "desc": "用于监控RabbitMQ的运行状态、资源使用、消息流量和队列健康状况。"
    },
    "ActiveMQ": {
        "name": "ActiveMQ",
        "desc": "用于采集 ActiveMQ 主题相关指标，实时监控消费者数量、入队/出队速率，以及主题消息堆积情况，确保消息队列运行稳定。"
    },
    "Nginx": {
        "name": "Nginx",
        "desc": "通过采集Nginx请求、连接状态及处理效率等指标，帮助监控和优化网站的性能与稳定性。"
    },
    "Tomcat": {
        "name": "Tomcat",
        "desc": "用于采集Tomcat连接器和JVM内存的关键性能指标，帮助监控服务器资源使用、请求处理效率及错误情况，优化系统性能。"
    },
    "Consul": {
        "name": "Consul",
        "desc": "用于实时监控 Consul 服务健康状态，采集状态检查结果，分析通过、警告和关键性指标，帮助用户及时发现故障并确保服务高可用性。"
    },
    "ElasticSearch": {
        "name": "ElasticSearch",
        "desc": "通过收集 Elasticsearch 文件系统、HTTP 请求、IO 统计、文档统计、查询缓存和截断器的相关指标，帮助用户监控集群健康状态和性能表现。"
    },
    "MongoDB": {
        "name": "MongoDB",
        "desc": "通过采集 MongoDB 的读写活动、命令执行、连接数、延迟、内存使用及网络流量指标，帮助优化性能，保障数据库高效稳定运行。"
    },
    "Mysql": {
        "name": "Mysql",
        "desc": "用于收集和监控MySQL数据库健康状况及性能的关键指标。"
    },
    "Postgres": {
        "name": "Postgres",
        "desc": "通过采集 PostgreSQL 的会话管理、事务指标和 I/O性能相关数据，帮助监控数据库的资源使用状况、访问行为和运行效率以及潜在问题。"
    },
    "Redis": {
        "name": "Redis",
        "desc": "用于采集 Redis 性能及资源使用情况的关键指标，帮助提升系统效率和稳定性。"
    },
    "Docker": {
        "name": "Docker",
        "desc": "用于采集和分析 Docker 容器的状态、资源使用情况（CPU、内存、网络、IO）和性能指标，帮助识别异常及优化容器运行效率。"
    },
    "vCenter": {
        "name": "vCenter",
        "desc": "vCenter是VMware的虚拟化管理中枢，用于监控资源（CPU/内存/存储/网络）、分析性能并优化配置。帮助识别虚拟机/主机异常，提升环境效率。"
    }
}

MONITOR_OBJECT_METRIC_GROUP = {
    "Host": {
        "CPU": "CPU",
        "System": "系统",
        "Disk IO": "磁盘 IO",
        "DISK": "磁盘",
        "Process": "进程",
        "MEMORY": "内存",
        "Net": "网络",
    },
    "Website": {
        "HTTP": "HTTP",
    },
    "Ping": {
        "Ping": "Ping",
    },
    "Cluster": {
        "Counts": "数量",
        "Utilization": "使用率",
    },
    "Pod": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Network": "网络",
    },
    "Node": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Net": "网络",
        "Load": "负载",
    },
    "Switch": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Router": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Loadbalance": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Firewall": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Detection Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Bastion Host": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Scanning Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Storage": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
        "Power": "功率",
        "Environment": "环境",
    },
    "Hardware Server": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
        "Power": "功率",
        "Environment": "环境",
    },
    "SNMP Trap": {
    },
    "Zookeeper": {
        "Uptime": "运行时间",
        "Performance": "性能",
        "Connection": "连接",
        "Znode": "Znode",
        "Traffic": "流量",
    },
    "Apache": {
        "Uptime": "运行时间",
        "Work": "线程",
        "Request": "请求",
        "CPU": "CPU",
        "Duration": "响应时间",
    },
    "ClickHouse": {
        "Uptime": "运行时间",
        "Memory": "内存",
        "Disk": "磁盘",
        "Query": "查询",
        "Part": "分片",
        "Load": "负载",
    },
    "RabbitMQ": {
        "Exchange": "交换消息",
        "Node": "Node",
        "Message": "消息",
    },
    "ActiveMQ": {
        "Topic": "Topic",
    },
    "Nginx": {
        "Request": "请求",
        "Connection": "连接",
        "Efficiency": "效率",
    },
    "Tomcat": {
        "Request": "请求",
        "Net": "网络",
        "Threads": "线程",
        "Error": "错误",
        "JMX ": "JMX ",
    },
    "Consul": {
        "Check": "检查情况",
    },
    "ElasticSearch": {
        "Disk": "磁盘",
        "HTTP": "HTTP",
        "IO": "IO",
        "Indices": "索引",
        "Cache": "缓存",
        "Circuit Breakers": "断路器",
    },
    "MongoDB": {
        "Active Operations": "活动操作",
        "Commands": "指令",
        "Connections": "连接",
        "Latency": "延迟",
        "Memory": "内存",
        "Traffic": "流量",
        "Storage": "存储",
    },
    "Mysql": {
        "Connection": "连接",
        "Error": "错误",
        "Cache": "缓存",
        "Traffic": "流量",
        "Command": "命令",
        "Session": "会话",
    },
    "Postgres": {
        "Performance": "性能",
        "Cache": "缓存",
        "Memory": "内存",
        "Transaction": "事务",
        "Session": "会话",
    },
    "Redis": {
        "Performance": "性能",
        "Cache": "缓存",
        "Memory": "内存",
        "Clients": "客户端",
        "CPU": "CPU",
        "Replication": "复制",
        "Disk": "磁盘",
        "Connectivity": "连接",
    },
    "Redis": {
        "Performance": "性能",
        "Cache": "缓存",
        "Memory": "内存",
        "Clients": "客户端",
        "CPU": "CPU",
        "Replication": "复制",
        "Disk": "磁盘",
        "Connectivity": "连接",
    },
    "Docker": {
        "Docker Count": "Docker数量",
    },
    "Docker Container": {
        "Memory": "内存",
        "CPU": "CPU",
        "Net": "网络",
        "Status": "状态",
        "IO": "IO",
    },
    "vCenter": {
        "Quantity": "数量",
    },
    "ESXI": {
        "Memory": "内存",
        "CPU": "CPU",
        "Disk": "磁盘",
        "Network": "网络",
    },
    "DataStorage": {
        "Default": "默认分组",
    },
    "VM": {
        "Memory": "内存",
        "CPU": "CPU",
        "Disk": "磁盘",
        "Network": "网络",
        "Power": "电源",
    }
}



MONITOR_OBJECT_METRIC = {
    "Host": {
    "cpu_summary.usage": {
        "name": "CPU 使用率",
        "desc": "显示CPU的使用率，来表示系统的负载情况。它通过总量减去空闲量得出。此指标对监控系统性能非常关键。"
    },
    "cpu_summary.idle": {
        "name": "CPU 空闲率",
        "desc": "显示CPU的空闲率，表示系统中未被使用的CPU资源量。这有助于了解系统是否处于高负载。此指标对分析系统性能和效率至关重要。"
    },
    "cpu_summary.iowait": {
        "name": "等待 IO 的时间占比",
        "desc": "显示CPU等待IO操作完成的时间占比，这指示出磁盘或网络性能对系统的影响程度。减少等待时间有助于提升系统性能。此指标对分析系统瓶颈点非常有用。"
    },
    "cpu_summary.system": {
        "name": "系统占用率",
        "desc": "显示系统占用率，表示内核进程消耗的CPU资源，分析该值有助于优化系统内核的性能和稳定性。"
    },
    "cpu_summary.user": {
        "name": "用户占用率",
        "desc": "显示用户进程占用的CPU资源比例，这帮助了解应用程序和服务的性能。本指标对于了解具体应用的CPU消耗有帮助。"
    },
    "load1": {
        "name": "1 分钟平均负载",
        "desc": "显示系统在最近一分钟内的平均负载，提供短期内系统活动的快照。本指标有助于实时监控系统性能。"
    },
    "load5": {
        "name": "5 分钟平均负载",
        "desc": "显示系统在最近五分钟内的平均负载，反映中期系统的负载情况。此中期指标有助于发现持续和间歇性的高负载情况。"
    },
    "load15": {
        "name": "15 分钟平均负载",
        "desc": "显示系统在最近十五分钟内的平均负载，长时间的负载观察有助于了解系统的整体性能趋势。"
    },
    "diskio_writes": {
        "name": "磁盘写入速率",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘的操作次数。"
    },
    "diskio_write_bytes": {
        "name": "磁盘写入大小",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘的字节数，并用兆字节 (MB) 表示。"
    },
    "diskio_write_time": {
        "name": "磁盘写入耗时",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘所用的时间，以秒 (s) 为单位。"
    },
    "diskio_reads": {
        "name": "磁盘读出速率",
        "desc": "统计在指定时间间隔内，系统从磁盘读取数据的操作次数。"
    },
    "diskio_read_bytes": {
        "name": "磁盘读出大小",
        "desc": "统计在指定时间间隔内，系统从磁盘读取的字节数，并用兆字节 (MB) 表示。"
    },
    "diskio_read_time": {
        "name": "磁盘读出耗时",
        "desc": "统计在指定时间间隔内，系统从磁盘读取数据所用的时间，以秒 (s) 为单位。"
    },
    "disk.is_use": {
        "name": "磁盘使用率",
        "desc": "显示磁盘空间的使用比例，帮助了解磁盘资源的使用情况。该指标对防止磁盘满溢非常重要。"
    },
    "disk.used": {
        "name": "磁盘已用空间大小",
        "desc": "显示实际使用的磁盘空间（以GB为单位），用于确定磁盘容量使用情况。本指标对监控磁盘空间的使用量很有帮助。"
    },
    "env.procs": {
        "name": "总进程数",
        "desc": "显示系统中运行的总进程数，帮助了解系统负载分布情况。此指标对监控系统的整体运行情况非常重要。"
    },
    "env.proc_running_current": {
        "name": "正在运行进程数",
        "desc": "显示当前正在运行的进程数，用于评估系统的并发运行情况。此指标对实时监控系统负载有重要价值。"
    },
    "env.procs_blocked_current": {
        "name": "正在等待 IO 的进程数",
        "desc": "显示正在等待IO操作的进程数，分析此值有助于优化系统性能并减少瓶颈。此指标对发现IO瓶颈很有帮助。"
    },
    "mem.total": {
        "name": "物理内存总大小",
        "desc": "显示系统的总物理内存量（单位为GB），概述系统资源配置。此指标对了解系统资源的基础配置很重要。"
    },
    "mem.free": {
        "name": "物理内存空闲量",
        "desc": "显示当前空闲的物理内存量（单位为GB），帮助了解可用资源。此指标是掌握内存资源使用情况的关键。"
    },
    "mem.cached": {
        "name": "Cache 缓存的空间大小",
        "desc": "显示用于缓存的内存量（单位为GB），用于提高系统性能。该指标对理解内存缓存策略非常重要。"
    },
    "mem.buffer": {
        "name": "Buffer 的空间大小",
        "desc": "显示用于缓冲的内存量（单位为GB），保障数据的稳定传输。此指标对于性能优化策略非常重要。"
    },
    "mem.usable": {
        "name": "应用程序内存可用量",
        "desc": "显示应用程序可用的内存（单位为GB），确保应用的平稳运行。此指标对维持应用性能和稳定性很重要。"
    },
    "mem.pct_usable": {
        "name": "应用程序内存可用率",
        "desc": "显示内存可用率，帮助确定内存是否充足以支持应用程序。该指标对监控内存压力和扩容策略有用。"
    },
    "mem.used": {
        "name": "应用程序内存使用量",
        "desc": "显示应用程序使用的内存量（单位为GB），分析此值有助于优化应用内存使用。此指标对监控应用资源消耗非常关键。"
    },
    "mem.pct_used": {
        "name": "应用程序内存使用占比",
        "desc": "显示应用程序内存使用占比，了解内存使用分布情况。此指标对优化内存使用有重要参考价值。"
    },
    "mem.psc_used": {
        "name": "物理内存已用量",
        "desc": "显示系统已用的物理内存总量（单位为GB），帮助整体掌握内存资源分配。此指标对全面了解系统内存使用情况非常重要。"
    },
    "mem.shared": {
        "name": "共享内存使用量",
        "desc": "显示共享内存的使用量（单位为GB），用于进程间的数据共享。此指标对优化系统内存分配策略有帮助。"
    },
    "net.speed_packets_recv": {
        "name": "网卡入包量",
        "desc": "显示单位时间内网络接口接收的数据包数量，用于评估网络接收性能。本指标对监控网络流量非常关键。"
    },
    "net.speed_packets_sent": {
        "name": "网卡出包量",
        "desc": "显示单位时间内网络接口发送的数据包数量，用于评估网络发送性能。本指标对监控网络流量非常关键。"
    },
    "net.speed_recv": {
        "name": "网卡入流量",
        "desc": "显示单位时间内网络接口接收的字节数量（单位为MB），用于评估网络带宽利用率。本指标对监控网络带宽非常重要。"
    },
    "net.speed_sent": {
        "name": "网卡出流量",
        "desc": "显示单位时间内网络接口发送的字节数量（单位为MB），用于评估网络带宽利用率。本指标对监控网络带宽非常关键。"
    },
    "net.errors_in": {
        "name": "网卡错误包",
        "desc": "显示网络接口接收到的错误包数量，用于检测网络问题。此指标对发现网络故障和不正常流量非常有帮助。"
    },
    "net.errors_out": {
        "name": "网卡错误包",
        "desc": "显示网络接口发送的错误包数量，帮助了解网络传输错误。此指标对发现网络故障和不正常流量非常有帮助。"
    },
    "net.dropped_in": {
        "name": "网卡丢弃包",
        "desc": "显示网络接口接收到的丢弃包数量，指示网络接收拥塞情况。本指标对监控网络可靠性非常关键。"
    },
    "net.dropped_out": {
        "name": "网卡丢弃包",
        "desc": "显示网络接口发送的丢弃包数量，指示网络发送拥塞情况。本指标对监控网络可靠性非常关键。"
    }
},
    "Website": {
    "http_success.rate": {
        "name": "拨测成功率",
        "desc": "衡量多个节点在拨测目标时成功响应的比例（成功次数占总请求次数的百分比）。"
    },
    "http_duration": {
        "name": "HTTP响应时间",
        "desc": "该指标表示从发起HTTP请求到接收到HTTP响应的总时间。用于评估Web服务的性能，尤其是在处理用户请求时。较长的持续时间可能表示后端处理效率低或网络延迟，影响用户体验。对提高系统响应性和优化性能至关重要。"
    },
    "http_code": {
        "name": "HTTP 响应状态码",
        "desc": "该指标用于表示HTTP请求的响应状态码。它记录了HTTP响应状态码的值，例如200（成功）、404（未找到）、500（服务器错误）等。这些状态码对于监控Web应用程序的健康状况和性能非常重要，可以帮助识别潜在问题。"
    },
    "http_content.length": {
        "name": "HTTP内容长度",
        "desc": "该指标表示HTTP响应的内容长度，单位为字节。较大的内容长度可能导致数据传输时间过长，并消耗更多带宽。在优化网站性能或分析带宽使用时，监测此指标至关重要。了解响应内容大小可以帮助开发者进行优化。"
    }
},
    "Ping":{
    "ping_ttl": {
        "name": "平均TTL",
        "desc": "表示 ping 数据包从源设备到目标设备允许的平均跳数（或时间）。此指标有助于发现数据包是否经过了异常多的跳数或是否存在路径异常。TTL 值较高时网络路径较长。"
    },
    "ping_response_time": {
        "name": "平均响应时间",
        "desc": "表示一段时间内，目标设备的 ping 响应时间的均值。该指标帮助衡量目标设备与源设备的延迟表现。较低的平均响应时间表示网络性能较好。"
    },
    "ping_packet_transmission_rate": {
        "name": "数据包传输成功率",
        "desc": "表示成功接收的数据包数占发送数据包总数的百分比。此指标用于衡量网络质量和数据传输的可靠性。丢包率低表示网络连接稳定且可靠。"
    },
    "ping_packet_loss_rate": {
        "name": "数据包丢失率",
        "desc": "表示在 ping 请求中丢失数据包所占的百分比。此指标帮助确定不稳定的网络连接或传输问题。较低的丢失率表示网络连接更稳定。"
    },
    "ping_error_response_code": {
        "name": "Ping状态",
        "desc": "表示 ping 操作执行后的结果代码。结果代码为 0 表示操作成功，非零值表示网络或主机可能存在问题。该指标用于快速检测网络连接故障。"
    }
},
    "Cluster": {
        "cluster_pod_count": {
            "name": "Pod Count",
            "desc": "用于统计当前 Kubernetes 集群中 Pods 的总数。该指标会返回集群中运行的 Pod 的数量，包括所有命名空间中的 Pod。"
        },
        "cluster_node_count": {
            "name": "Node Count",
            "desc": "用于统计当前 Kubernetes 集群中节点的总数。该指标返回集群中可用节点的数量，帮助用户了解集群的规模和资源。"
        },
        "cluster_cpu_utilization": {
            "name": "CPU Utilization",
            "desc": "表示集群中 CPU 的当前利用率，通常以百分比形式表示。"
        },
        "cluster_memory_utilization": {
            "name": "Memory Utilization",
            "desc": "显示集群内存的当前利用率，以百分比形式展示。"
        }
    },
    "Pod": {
        "pod_status": {
            "name": "Pod状态",
            "desc": "获取 Pod 当前的状态信息，例如已运行、已停止等。"
        },
        "pod_restart_count": {
            "name": "重启次数",
            "desc": "监控 Pod 内各个容器的重启次数，以评估稳定性与问题频发程度。"
        },
        "pod_cpu_utilization": {
            "name": "CPU使用率",
            "desc": "计算 Pod CPU 使用率，即容器 CPU 限制与请求的差值，反映 CPU 资源的入住情况。"
        },
        "pod_memory_utilization": {
            "name": "内存使用率",
            "desc": "计算 Pod 的内存利用率，即内存限制与请求的比例。"
        },
        "pod_io_writes": {
            "name": "I/O写速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O写入操作次数。写入次数可以帮助分析应用程序对存储系统的写入需求。"
        },
        "pod_io_read": {
            "name": "I/O读速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O读取操作次数。读取次数可以帮助分析应用程序对存储系统的读取需求。"
        },
        "pod_network_in": {
            "name": "网络入流量",
            "desc": "监控 Pod 的网络流入流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        },
        "pod_network_out": {
            "name": "网络出流量",
            "desc": "监控 Pod 的网络流出流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        }
    },
    "Node":{
  "node_status_condition": {
    "name": "Node状态",
    "desc": "Node状态用于指示节点的当前运行状态，比如“运行中”或“已停止”。它有助于管理员监控和管理Kubernetes集群中的节点。"
  },
  "node_cpu_utilization": {
    "name": "CPU使用率",
    "desc": "CPU使用率表示当前节点CPU的实际使用水平，相对于其总可用CPU资源。监控此指标有助于识别CPU瓶颈和优化资源分配。"
  },
  "node_memory_usage": {
    "name": "应用内存使用量",
    "desc": "应用内存使用量表示在节点中运行的应用程序占用的内存总量。此指标有助于了解应用程序的内存需求及其对系统性能的影响。"
  },
  "node_memory_utilization": {
    "name": "应用内存使用率",
    "desc": "应用内存使用率是指应用程序已使用的内存量与其配置的内存限制之比。通过监控此指标，用户可以判断是否需要调整内存限制。"
  },
  "node_io_read": {
    "name": "磁盘写速率",
    "desc": "磁盘写速率表示节点在特定时间段内进行的写入操作的速率。此指标对于监控应用程序的磁盘写入性能至关重要。"
  },
  "node_io_write": {
    "name": "磁盘读速率",
    "desc": "磁盘读速率表示节点在特定时间段内进行的读取操作的速率。此指标有助于评估应用程序的数据读取性能和存储负载。"
  },
  "node_network_receive": {
    "name": "网卡入流量",
    "desc": "网卡入流量是指通过网络接口接收到的数据流量。监控此指标可帮助分析网络带宽是否足够以及网络性能情况。"
  },
  "node_network_transmit": {
    "name": "网卡出流量",
    "desc": "网卡出流量是指通过网络接口发送的数据流量。此指标有助于了解节点的网络出口需求和潜在的瓶颈。"
  },
  "node_cpu_load1": {
    "name": "1 分钟平均负载",
    "desc": "1 分钟平均负载表示过去1分钟内系统的平均负载情况。该指标有助于即时了解系统的负载水平。"
  },
  "node_cpu_load5": {
    "name": "5 分钟平均负载",
    "desc": "5 分钟平均负载表示过去5分钟内系统的平均负载情况。此指标有助于识别负载趋势及其对系统性能的影响。"
  },
  "node_cpu_load15": {
    "name": "15 分钟平均负载",
    "desc": "15 分钟平均负载表示过去15分钟内系统的平均负载情况。监控该指标可帮助管理员理解系统的长期负载状态。"
  }
    },
    "Switch": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Router": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Loadbalance": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Firewall": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Detection Device": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Bastion Host": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Scanning Device": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Storage": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  },
   "ipmi_chassis_power_state": {
        "name": "电源状态",
        "desc": "电源状态指标，用于监测设备是否处于开机状态。其值可以表示电源开启或关闭状态。主要用于远程管理和监控设备的电源情况。"
    },
    "ipmi_power_watts": {
        "name": "功率",
        "desc": "功率指标以瓦特 (watts) 为单位，反映设备当前功耗。通过此指标可以评估设备能效和功耗趋势。便于设置节能政策和资源优化。"
    },
    "ipmi_voltage_volts": {
        "name": "电压功率",
        "desc": "电压功率指标以伏特 (volts) 为单位，监测设备内部不同电源轨的电压情况。稳定的电压供应对于设备的可靠性至关重要。通过该指标可以快速识别电气问题，保障正常运行。"
    },
    "ipmi_fan_speed_rpm": {
        "name": "风扇转速",
        "desc": "风扇转速指标以每分钟转数 (rpm) 表示，监测设备内风扇的工作状态。高效的风扇运作是维护设备温度的关键。有助于防止过热，确保设备长时间稳定运行。"
    },
    "ipmi_temperature_celsius": {
        "name": "温度",
        "desc": "温度指标以摄氏度 (Celsius) 为单位，监控设备内部温度。通过监测温度可以预防热量累积，防止设备过热。对于维持系统的稳定性和寿命非常关键。"
    }
    },
    "Hardware Server": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  },
   "ipmi_chassis_power_state": {
        "name": "电源状态",
        "desc": "电源状态指标，用于监测设备是否处于开机状态。其值可以表示电源开启或关闭状态。主要用于远程管理和监控设备的电源情况。"
    },
    "ipmi_power_watts": {
        "name": "功率",
        "desc": "功率指标以瓦特 (watts) 为单位，反映设备当前功耗。通过此指标可以评估设备能效和功耗趋势。便于设置节能政策和资源优化。"
    },
    "ipmi_voltage_volts": {
        "name": "电压功率",
        "desc": "电压功率指标以伏特 (volts) 为单位，监测设备内部不同电源轨的电压情况。稳定的电压供应对于设备的可靠性至关重要。通过该指标可以快速识别电气问题，保障正常运行。"
    },
    "ipmi_fan_speed_rpm": {
        "name": "风扇转速",
        "desc": "风扇转速指标以每分钟转数 (rpm) 表示，监测设备内风扇的工作状态。高效的风扇运作是维护设备温度的关键。有助于防止过热，确保设备长时间稳定运行。"
    },
    "ipmi_temperature_celsius": {
        "name": "温度",
        "desc": "温度指标以摄氏度 (Celsius) 为单位，监控设备内部温度。通过监测温度可以预防热量累积，防止设备过热。对于维持系统的稳定性和寿命非常关键。"
    }
    },
    "SNMP Trap": {        
    },
    "Zookeeper": {
    "zookeeper_uptime": {
        "name": "系统运行时间",
        "desc": "该指标表示Zookeeper服务的运行时长，用于监测系统是否正常运行。"
    },
    "zookeeper_avg_latency": {
        "name": "平均延迟",
        "desc": "该指标表示Zookeeper处理请求的平均延迟时间，用于监测系统的响应能力。"
    },
    "zookeeper_read_write_ratio": {
        "name": "读写比",
        "desc": "该指标表示Zookeeper提交和快照的比例，用于判断Zookeeper的读写负载分布。"
    },
    "zookeeper_snapshot_to_commit_ratio": {
        "name": "快照与提交比",
        "desc": "该指标表示Zookeeper生成快照的频率与提交请求的频率的比值，用于监测持久化操作与事务提交的关系。"
    },
    "zookeeper_connection_drop_count": {
        "name": "连接断开次数",
        "desc": "该指标表示Zookeeper连接断开的次数，用于监测连接稳定性。"
    },
    "zookeeper_connection_rejected": {
        "name": "拒绝连接次数",
        "desc": "该指标表示Zookeeper拒绝的连接次数，用于监测连接是否被正确处理。"
    },
    "zookeeper_znode_count": {
        "name": "Znode数量",
        "desc": "该指标表示Zookeeper中当前5分钟内每秒Znode的变化数量，有助于监测Zookeeper的数据量变化。"
    },
    "zookeeper_packets_received": {
        "name": "接收的包数量",
        "desc": "该指标表示Zookeeper接收到的网络包数量，用于监测网络流量情况。"
    }
},
"Apache": {
    "apache_uptime": {
        "name": "系统运行时长",
        "desc": "该指标表示Apache服务器自启动以来的运行时间，用于监测服务器的健康状态。"
    },
    "apache_busy_workers": {
        "name": "繁忙工作进程数",
        "desc": "该指标表示Apache服务器中当前处于繁忙状态的工作进程数，用于评估服务器的负载情况。"
    },
    "apache_idle_workers": {
        "name": "空闲工作进程数",
        "desc": "该指标表示Apache服务器中当前处于空闲状态的工作进程数，反映了服务器的资源利用情况。"
    },
    "apache_req_per_sec": {
        "name": "每秒请求数",
        "desc": "该指标表示Apache每秒处理的请求数量，用于监测服务器的请求处理能力。"
    },
    "apache_bytes_per_sec": {
        "name": "每秒字节数",
        "desc": "该指标表示Apache每秒传输的字节数，反映了网络流量的情况。"
    },
    "apache_total_accesses": {
        "name": "总访问次数",
        "desc": "该指标表示Apache服务器自启动以来的总访问次数，反映服务器的总体请求量。"
    },
    "apache_total_duration": {
        "name": "总处理时长",
        "desc": "该指标表示Apache服务器自启动以来的总请求处理时长，用于评估服务器的处理负载。"
    },
    "apache_cpu_system": {
        "name": "系统CPU使用率",
        "desc": "该指标表示Apache服务器在系统层面的CPU使用率。"
    },
    "apache_cpu_user": {
        "name": "用户CPU使用率",
        "desc": "该指标表示Apache服务器在用户进程层面的CPU使用率。"
    },
    "apache_cpu_load": {
        "name": "CPU负载",
        "desc": "该指标表示Apache服务器的CPU负载情况，反映系统的总体负载状态。"
    },
    "apache_duration_per_req": {
        "name": "每个请求的处理时长",
        "desc": "该指标表示每个请求的平均处理时长，帮助评估服务器处理请求的效率。"
    }
},
"ClickHouse": {
    "clickhouse_asynchronous_metrics_uptime": {
        "name": "系统运行时间",
        "desc": "ClickHouse 运行的时间，以分钟为单位，反映实例的稳定性和重启频率。"
    },
    "clickhouse_metrics_memory_tracking": {
        "name": "内存使用量",
        "desc": "ClickHouse 当前进程消耗的内存，用于监控内存使用增长趋势。"
    },
    "clickhouse_asynchronous_metrics_os_memory_available": {
        "name": "可用内存",
        "desc": "系统当前可以用于进程的物理内存总量，反映资源利用率情况。"
    },
    "clickhouse_asynchronous_metrics_disk_used_default": {
        "name": "磁盘使用量（默认盘）",
        "desc": "当前已使用的磁盘存储空间，用于评估存储容量和扩展需求。"
    },
    "clickhouse_asynchronous_metrics_disk_total_default": {
        "name": "磁盘总容量（默认盘）",
        "desc": "默认磁盘的总容量，用于评估可用存储容量以及集群规划。"
    },
    "clickhouse_events_query": {
        "name": "查询速率",
        "desc": "ClickHouse 每秒处理的查询数量，展示系统的处理性能能力。"
    },
    "clickhouse_events_inserted_rows": {
        "name": "插入行速率",
        "desc": "最近五分钟内插入的行数速率，衡量数据写入性能。"
    },
    "clickhouse_events_select_query": {
        "name": "查询行速率",
        "desc": "最近五分钟内处理的 SELECT 查询的速率，衡量查询性能。"
    },
    "clickhouse_events_compressed_read_buffer_bytes": {
        "name": "压缩数据读取速率",
        "desc": "ClickHouse 系统读取的压缩数据速率，展示 IO 性能和数据读取效率。"
    },
    "clickhouse_metrics_parts_active": {
        "name": "活跃分片数",
        "desc": "显示 MergeTree 表当前的活跃分片数量，用于监控表的碎片管理情况及状态。"
    },
    "clickhouse_metrics_parts_outdated": {
        "name": "过期分片数",
        "desc": "表示 MergeTree 表中的过期分片数量，用于监控分片清理及磁盘回收状态。"
    },
    "clickhouse_asynchronous_metrics_load_average1": {
        "name": "系统负载（1分钟）",
        "desc": "系统在最近 1 分钟的负载平均值，展示资源消耗和任务压力。"
    }
},
"RabbitMQ": {
    "rabbitmq_exchange_publish_in_rate": {
        "name": "交换发布进入速率",
        "desc": "该指标表示每秒通过 RabbitMQ 交换机发布进入的消息数量。用于评估消息发布速率，帮助发现消息流入的瓶颈。"
    },
    "rabbitmq_exchange_publish_out_rate": {
        "name": "交换发布输出速率",
        "desc": "该指标表示每秒通过 RabbitMQ 交换机发布输出的消息数量。用于评估消息的流出速率，帮助识别消息流出问题。"
    },
    "rabbitmq_node_disk_free": {
        "name": "剩余磁盘空间",
        "desc": "该指标表示 RabbitMQ 节点上剩余的磁盘空间，单位为GiB。低磁盘空间可能会导致性能下降或故障。"
    },
    "rabbitmq_node_fd_used": {
        "name": "已用文件描述符数量",
        "desc": "该指标表示 RabbitMQ 节点已用的文件描述符数量。过多的文件描述符使用可能会导致系统无法处理更多的连接。"
    },
    "rabbitmq_node_mem_used": {
        "name": "内存使用量",
        "desc": "该指标表示 RabbitMQ 节点的内存使用情况。内存使用过高可能会导致性能下降，甚至导致节点崩溃。"
    },
    "rabbitmq_node_run_queue": {
        "name": "正在处理的队列数",
        "desc": "该指标表示 RabbitMQ 节点当前正在处理的队列数。队列数过多可能表明系统压力较大，且可能需要进行优化。"
    },
    "rabbitmq_node_uptime": {
        "name": "节点运行时间",
        "desc": "该指标表示 RabbitMQ 节点的运行时间，单位为分钟。长时间运行的节点可能需要重启来释放资源并进行维护。"
    },
    "rabbitmq_fd_usage_ratio": {
        "name": "文件描述符使用率",
        "desc": "该指标表示 RabbitMQ 节点已用文件描述符与总文件描述符的比例。过高的比例可能导致文件描述符不足。"
    },
    "rabbitmq_overview_messages_ready": {
        "name": "就绪消息数",
        "desc": "该指标表示当前待处理的消息数量。过多的就绪消息可能意味着消费者滞后或消息处理速度较慢。"
    },
    "rabbitmq_overview_messages_unacked": {
        "name": "未确认消息数",
        "desc": "该指标表示未被消费者确认的消息数量。未确认的消息过多可能表示消费者处理速度过慢，或者有未处理的消息积压。"
    },
    "rabbitmq_queue_message_backlog_ratio": {
        "name": "队列消息积压率",
        "desc": "该指标用于衡量队列中待处理消息与已确认消息的比例，帮助识别系统中是否存在消息积压。"
    },
    "rabbitmq_unacked_message_ratio": {
        "name": "未确认消息占比",
        "desc": "该指标用于衡量队列中未被消费者确认的消息比例，过高可能表示消费者处理消息滞后。"
    }
},
"ActiveMQ": {
    "activemq_topic_consumer_count": {
        "name": "消费者数量",
        "desc": "该指标表示每个主题的消费者数量，用于监测消费者是否均衡分布。"
    },
    "activemq_topic_dequeue_rate": {
        "name": "消息消费速率",
        "desc": "该指标表示主题的消息消费速率，即每秒钟消费的消息数量。"
    },
    "activemq_topic_enqueue_rate": {
        "name": "消息入队速率",
        "desc": "该指标表示主题的消息入队速率，即每秒钟入队的消息数量。"
    },
    "activemq_topic_size": {
        "name": "主题消息数",
        "desc": "该指标表示每个主题中未消费的消息数量，有助于识别主题是否存在消息积压。"
    }
},
"Nginx": {
    "nginx_requests": {
        "name": "每秒请求量",
        "desc": "表示过去 5 分钟内每秒处理的 HTTP 请求数量，反映服务器的负载情况。"
    },
    "nginx_accepts": {
        "name": "每秒连接建立量",
        "desc": "表示过去 5 分钟内每秒成功建立的客户端连接数量，用于监控连接活跃度。"
    },
    "nginx_handled": {
        "name": "每秒连接处理量",
        "desc": "表示过去 5 分钟内每秒成功处理的已连接会话数量，监控连接处理能力。"
    },
    "nginx_active": {
        "name": "当前活跃连接数",
        "desc": "当前所有处于活动状态的连接数，包含读取、写入和等待处理的所有连接。"
    },
    "nginx_waiting": {
        "name": "当前等待连接数",
        "desc": "当前处于等待状态（空闲）的连接数量，表示当前未处理的客户端连接。"
    },
    "nginx_reading": {
        "name": "当前读取连接数",
        "desc": "表示当前正在读取客户端请求（头部或主体）的连接数量，用于监控读取阶段的负载。"
    },
    "nginx_writing": {
        "name": "当前写入连接数",
        "desc": "表示当前正在向客户端写响应数据的连接数量，用于监控响应阶段的性能。"
    },
    "nginx_connect_rate": {
        "name": "连接处理成功率",
        "desc": "表示过去 5 分钟内已处理的连接数占总接收连接数量的百分比，可用于分析连接处理的稳定性。"
    },
    "nginx_request_handling_efficiency": {
        "name": "每个连接平均请求数",
        "desc": "表示每个处理连接的平均请求数量，间接反映了 Nginx 的工作效率以及负载级别。"
    }
},
"Tomcat": {
    "tomcat_connector_request_count": {
        "name": "请求数量",
        "desc": "该指标表示Tomcat连接器过去5分钟内平均每秒处理的总请求数，用于监控请求负载。"
    },
    "tomcat_connector_processing_time": {
        "name": "请求处理时间",
        "desc": "指标用于衡量 Tomcat 连接器在过去 5 分钟内处理请求时间的平均每秒变化情况。它能反映服务器处理请求的效率。"
    },
    "tomcat_connector_max_time": {
        "name": "最大请求处理时间",
        "desc": "该指标表示Tomcat连接器处理单个请求的最大时间，反映最慢请求的性能。"
    },
    "tomcat_connector_bytes_received": {
        "name": "接收字节数",
        "desc": "该指标表示 Tomcat 连接器在过去 5 分钟内平均每秒接收数据的字节数，可用于监控 Tomcat 服务器的网络流量负载。"
    },
    "tomcat_connector_bytes_sent": {
        "name": "发送字节数",
        "desc": "该指标表示Tomcat连接器在过去 5 分钟内平均每秒发送的字节数，用于监控流量和响应负载。"
    },
    "tomcat_connector_current_thread_count": {
        "name": "当前线程数",
        "desc": "该指标表示Tomcat连接器当前使用的线程数，用于监控并发能力。"
    },
    "tomcat_connector_current_threads_busy": {
        "name": "忙碌线程数",
        "desc": "该指标表示Tomcat连接器当前忙碌的线程数，用于监控并发处理情况。"
    },
    "tomcat_connector_max_threads": {
        "name": "最大线程数",
        "desc": "该指标表示Tomcat连接器的最大线程数，用于监控Tomcat的并发能力。"
    },
    "tomcat_connector_error_count": {
        "name": "错误数量",
        "desc": "该指标表示Tomcat连接器在过去 5 分钟内平均每秒处理请求时的错误次数，用于监控错误率。"
    },
    "tomcat_jvm_memory_free": {
        "name": "JMX 空闲内存",
        "desc": "该指标表示Tomcat JVM中的空闲内存量，用于监控内存使用情况。"
    },
    "tomcat_jvm_memory_max": {
        "name": "JMX 最大内存",
        "desc": "该指标表示Tomcat JVM的最大内存量，用于监控内存限制。"
    },
    "tomcat_jvm_memorypool_used": {
        "name": "JMX 已使用内存池",
        "desc": "该指标表示Tomcat JVM内存池已使用的内存量，用于监控内存池使用情况。"
    }
},
"Consul": {
    "consul_health_checks_status": {
        "name": "健康检查状态",
        "desc": "该指标表示Consul健康检查的状态，其中0为通过，1为警告，2为严重。"
    },
    "consul_health_checks_passing": {
        "name": "通过的健康检查数",
        "desc": "该指标表示当前通过的健康检查数量，用于监测健康检查的正常情况。"
    },
    "consul_health_checks_warning": {
        "name": "警告的健康检查数",
        "desc": "该指标表示当前处于警告状态的健康检查数量，用于监测潜在的服务问题。"
    },
    "consul_health_checks_critical": {
        "name": "严重的健康检查数",
        "desc": "该指标表示当前处于严重状态的健康检查数量，用于监测服务的重大故障。"
    }
},
"ElasticSearch": {
    "elasticsearch_fs_total_available_in_bytes": {
        "name": "磁盘剩余空间",
        "desc": "文件系统剩余可用空间，换算为 GB。"
    },
    "elasticsearch_fs_total_free_in_bytes": {
        "name": "磁盘总剩余空间",
        "desc": "文件系统内未分配的可用磁盘空间，用于监控整体容量。"
    },
    "elasticsearch_http_current_open": {
        "name": "当前 HTTP 连接数",
        "desc": "监控当前 HTTP 打开的连接数，判断负载状态。"
    },
    "elasticsearch_http_total_opened": {
        "name": "每 5 分钟新增 HTTP 连接数",
        "desc": "5 分钟内新建的 HTTP 连接数，可用于监测请求负载变化。"
    },
    "elasticsearch_fs_io_stats_total_write_kilobytes": {
        "name": "每秒磁盘写入速率",
        "desc": "监控磁盘写入速率（MB/s），用于分析 IO 性能。"
    },
    "elasticsearch_fs_io_stats_total_read_kilobytes": {
        "name": "每秒磁盘读取速率",
        "desc": "监控磁盘读取速率（MB/s），用于识别 IO 瓶颈。"
    },
    "elasticsearch_indices_docs_count": {
        "name": "索引文档总数",
        "desc": "当前 Elasticsearch 中所有索引的文档条数。"
    },
    "elasticsearch_indices_docs_deleted": {
        "name": "被删除文档总数",
        "desc": "被标记删除的文档总数，可用于评估段合并工作量。"
    },
    "elasticsearch_indices_query_cache_cache_count": {
        "name": "查询缓存条数",
        "desc": "监控查询缓存条目数，用于优化查询性能。"
    },
    "elasticsearch_breakers_parent_tripped": {
        "name": "父级断路器触发次数",
        "desc": "5 分钟内父级断路器触发的次数，监控内存超限情况。"
    },
    "elasticsearch_breakers_fielddata_tripped": {
        "name": "字段数据断路器触发次数",
        "desc": "5 分钟内字段数据断路器触发的次数，监控内存溢出情况。"
    }
},
"MongoDB": {
    "mongodb_active_reads": {
        "name": "活跃读操作",
        "desc": "当前正在执行的活跃读操作数，用于监控数据库负载情况。"
    },
    "mongodb_active_writes": {
        "name": "活跃写操作",
        "desc": "当前正在执行的活跃写操作数，用于监控数据库写入压力。"
    },
    "mongodb_commands": {
        "name": "每秒操作指令数",
        "desc": "每秒执行的数据库操作指令数，反映数据库负载。"
    },
    "mongodb_connections_current": {
        "name": "当前连接数",
        "desc": "当前正在与数据库通信的客户端连接数。"
    },
    "mongodb_latency_commands": {
        "name": "操作指令平均延迟",
        "desc": "数据库指令的平均延迟情况，用于评估数据库性能。"
    },
    "mongodb_resident_megabytes": {
        "name": "MongoDB 内存使用量",
        "desc": "数据库物理内存使用量，反映资源占用情况。"
    },
    "mongodb_net_in_bytes": {
        "name": "每秒接收流量",
        "desc": "每秒接收到的数据量，用于监控网络流量。"
    },
    "mongodb_net_out_bytes": {
        "name": "每秒发送流量",
        "desc": "每秒发送的数据量，用于监控网络流量。"
    },
    "mongodb_total_docs_scanned": {
        "name": "每秒扫描文档数量",
        "desc": "查询时扫描的文档数量，评估查询性能。"
    }
},
"Mysql": {
    "mysql_aborted_clients": {
        "name": "终止的客户端连接次数",
        "desc": "此指标表示由于客户端错误中止的连接次数。监控此指标可以帮助识别连接可靠性问题。"
    },
    "mysql_aborted_connects": {
        "name": "终止的连接尝试次数",
        "desc": "此指标表示因连接问题而终止的连接尝试次数。高值可能表示系统配置问题或服务器过载。"
    },
    "mysql_access_denied_errors": {
        "name": "访问拒绝错误次数",
        "desc": "此指标表示由于权限不足或认证失败导致的访问拒绝次数。监控此指标有助于识别和解决权限问题。"
    },
    "mysql_aria_pagecache_blocks_unused": {
        "name": "未使用的Aria页高速缓存块数",
        "desc": "此指标表示Aria存储引擎中未使用的页高速缓存块数。监控此指标可以帮助优化缓存分配。"
    },
    "mysql_aria_pagecache_blocks_used": {
        "name": "已使用的Aria页高速缓存块数",
        "desc": "此指标表示Aria存储引擎中已使用的页高速缓存块数。监控此指标可以帮助评估缓存的有效利用。"
    },
    "mysql_bytes_received": {
        "name": "接收字节数",
        "desc": "此指标表示MySQL服务器接收到的字节数。监控此指标可以了解网络流量负载情况。"
    },
    "mysql_bytes_sent": {
        "name": "发送字节数",
        "desc": "此指标表示MySQL服务器发送的字节数。监控此指标可以了解网络流量负载情况。"
    },
    "mysql_com_select": {
        "name": "Select命令执行次数",
        "desc": "此指标表示Select查询的执行次数。监控此指标有助于了解读取操作的频率和系统负载。"
    },
    "mysql_com_insert": {
        "name": "Insert命令执行次数",
        "desc": "此指标表示Insert命令的执行次数。监控此指标有助于了解写入操作的频率和系统负载。"
    },
    "mysql_com_update": {
        "name": "Update命令执行次数",
        "desc": "此指标表示Update命令的执行次数。监控此指标有助于了解更新操作的频率和系统负载。"
    },
    "mysql_com_delete": {
        "name": "Delete命令执行次数",
        "desc": "此指标表示Delete命令的执行次数。监控此指标有助于了解删除操作的频率和系统负载。"
    },
    "mysql_connections_total": {
        "name": "总连接创建数",
        "desc": "此指标表示从服务器启动以来创建的总连接数。监控连接总数有助于了解连接模式和流量。"
    }
},
"Postgres": {
    "postgresql_active_time": {
        "name": "活跃时间",
        "desc": "此指标表示 PostgreSQL 在活跃状态下的总时长，反映数据库活动的持续时间。"
    },
    "postgresql_blk_read_time": {
        "name": "块读耗时",
        "desc": "此指标表示 PostgreSQL 从磁盘读取数据块的总耗时。"
    },
    "postgresql_blk_write_time": {
        "name": "块写耗时",
        "desc": "此指标表示 PostgreSQL 将数据块写入磁盘的总耗时。"
    },
    "postgresql_blks_hit": {
        "name": "块缓存命中次数",
        "desc": "此指标表示 PostgreSQL 查询缓存命中数据块的次数，反映了缓存性能。"
    },
    "postgresql_blks_read": {
        "name": "块读取次数",
        "desc": "此指标表示 PostgreSQL 从磁盘读取的数据块数。"
    },
    "postgresql_buffers_alloc": {
        "name": "分配的缓存数",
        "desc": "此指标表示 PostgreSQL 分配的缓存块数，用于监控内存使用情况。"
    },
    "postgresql_buffers_checkpoint": {
        "name": "检查点缓存数",
        "desc": "此指标表示 PostgreSQL 在检查点期间写入的缓存块数。"
    },
    "postgresql_xact_commit": {
        "name": "提交事务数",
        "desc": "此指标表示 PostgreSQL 提交的事务总数，反映数据库的工作负载情况。"
    },
    "postgresql_xact_rollback": {
        "name": "回滚事务数",
        "desc": "此指标表示 PostgreSQL 执行的事务回滚操作的总数。"
    },
    "postgresql_sessions": {
        "name": "总会话数",
        "desc": "此指标表示 PostgreSQL 创建的总会话数，反映数据库连接活动。"
    },
    "postgresql_sessions_abandoned": {
        "name": "放弃会话数",
        "desc": "此指标表示因长时间未使用而被放弃的会话的计数。"
    },
    "postgresql_sessions_killed": {
        "name": "被终止会话数",
        "desc": "此指标表示被管理员或系统主动终止的会话总数。"
    }
},
"Redis": {
    "redis_used_memory": {
        "name": "已用内存",
        "desc": "Redis 所使用的总内存大小，包括所有内部数据结构和缓存。"
    },
    "redis_mem_fragmentation_ratio": {
        "name": "内存碎片率",
        "desc": "内存碎片率，反映内存使用效率。"
    },
    "redis_instantaneous_ops_per_sec": {
        "name": "每秒操作次数",
        "desc": "当前每秒处理的 Redis 命令数（QPS）。"
    },
    "redis_keyspace_hits": {
        "name": "键空间命中次数",
        "desc": "缓存命中的次数。"
    },
    "redis_keyspace_misses": {
        "name": "键空间未命中次数",
        "desc": "缓存未命中的次数。"
    },
    "redis_clients": {
        "name": "已连接客户端数",
        "desc": "当前连接的客户端数量，反映活跃连接数。"
    },
    "redis_used_cpu_sys": {
        "name": "CPU 使用率（系统）",
        "desc": "Redis 进程消耗的系统 CPU 时间总计。"
    },
    "redis_evicted_keys": {
        "name": "驱逐的键数",
        "desc": "因内存限制而被逐出的键值数量。"
    },
    "redis_connected_slaves": {
        "name": "已连接从节点数",
        "desc": "当前连接到主节点的副本数量。"
    },
    "redis_rdb_last_save_time_elapsed": {
        "name": "上次保存经过时间",
        "desc": "上次成功进行 RDB 保存操作后的经过时间。"
    },
    "redis_rejected_connections": {
        "name": "拒绝的连接数",
        "desc": "因服务器过载或策略限制而被拒绝的连接数。"
    }
},
"Docker": {
    "docker_n_containers": {
        "name": "容器总数",
        "desc": "该指标表示Docker主机上容器总数，反映主机的负载情况。"
    },
    "docker_n_containers_running": {
        "name": "正在运行的容器数",
        "desc": "该指标表示Docker主机上正在运行的容器数，反映主机的负载情况。"
    },
    "docker_n_containers_stopped": {
        "name": "停止的容器数",
        "desc": "该指标表示Docker主机上停止的容器数，帮助了解容器的运行情况。"
    },
},
"Docker Container": {
    "docker_container_status": {
        "name": "容器状态",
        "desc": "该指标表示容器的状态，0表示容器正常。"
    },
    "docker_container_status_restart_count": {
        "name": "重启次数",
        "desc": "该指标表示容器的重启次数，帮助监控容器是否频繁重启。"
    },
    "docker_container_cpu_usage_percent": {
        "name": "CPU使用率",
        "desc": "该指标表示容器的CPU使用百分比，监控容器的CPU负载情况。"
    },
    "docker_container_mem_usage_percent": {
        "name": "内存使用率",
        "desc": "该指标表示容器的内存使用百分比，监控容器的内存负载情况。"
    },
    "docker_container_blkio_io_service_bytes_recursive_total": {
        "name": "总块I/O字节数",
        "desc": "该指标表示容器的总块I/O字节数，反映容器的磁盘I/O负载。"
    },
    "docker_container_net_rx_bytes": {
        "name": "接收网络字节数",
        "desc": "该指标表示容器接收到的网络字节数，单位是MiB，用于监控容器的网络流量。"
    },
    "docker_container_net_tx_bytes": {
        "name": "发送网络字节数",
        "desc": "该指标表示容器发送的网络字节数，单位是MiB，用于监控容器的网络流量。"
    }
},
"vCenter": {
        "vmware_esxi_count": {
            "name": "ESXI数量",
            "desc": "该指标用于统计 VMware 环境中 ESXi 主机的数量，帮助管理员了解当前的物理主机资源情况。"
        },
        "vmware_datastore_count": {
            "name": "数据存储数量",
            "desc": "该指标统计 VMware 环境中数据存储的数量，便于监控存储资源的分配和使用情况。"
        },
        "vmware_vm_count": {
            "name": "虚拟机数量",
            "desc": "该指标统计 VMware 环境中虚拟机的数量，用于评估虚拟化资源的使用情况。"
        }
    },
"ESXI": {
        "esxi_cpu_usage_average_gauge": {
        "name": "CPU使用率",
        "desc": "表示系统或应用程序的CPU使用率，单位是百分比（%），是衡量CPU负载和性能的关键指标。"
        },
        "esxi_cpu_usagemhz_average_gauge": {
            "name": "CPU使用频率",
            "desc": "代表CPU的使用量，以兆赫兹（MHz）为单位，反映了CPU的实际工作频率。"
        },
        "esxi_mem_usage_average_gauge": {
            "name": "内存使用率",
            "desc": "内存使用率，表示内存的使用情况，单位是百分比（%），用于评估系统或应用程序的内存负载。"
        },
        "esxi_mem_consumed_average_gauge": {
            "name": "活动内存",
            "desc": "活动内存，表示系统或应用程序实际使用的内存量，单位是兆字节（MB），是内存消耗的关键指标。"
        },
        "esxi_disk_read_average_gauge": {
            "name": "磁盘读速率",
            "desc": "磁盘读速率，表示每秒钟从磁盘读取的数据量，单位是兆字节每秒（MB/s），是衡量磁盘读性能的重要指标。"
        },
        "esxi_disk_write_average_gauge": {
            "name": "磁盘写速率",
            "desc": "磁盘写速率，表示每秒钟向磁盘写入的数据量，单位是兆字节每秒（MB/s），是衡量磁盘写性能的重要指标。"
        },
        "esxi_disk_numberRead_summation_gauge": {
            "name": "磁盘读I/O",
            "desc": "表示每秒完成的磁盘读操作次数，单位是IOPS（次/秒），是衡量磁盘读请求频率的重要指标。值越高，表示磁盘读请求越频繁。"
        },
        "esxi_disk_numberWrite_summation_gauge": {
            "name": "磁盘写I/O",
            "desc": "表示每秒完成的磁盘写操作次数，单位是IOPS（次/秒），是衡量磁盘写请求频率的重要指标。值越高，表示磁盘写请求越频繁。"
        },
        "esxi_net_bytesRx_average_gauge": {
            "name": "网络接收速率",
            "desc": "网络接收速率，表示每秒钟接收到的数据量，单位是千字节每秒（KB/s），是网络流量的重要衡量标准。"
        },
        "esxi_net_bytesTx_average_gauge": {
            "name": "网络发送速率",
            "desc": "网络发送速率，表示每秒钟发送出去的数据量，单位是千字节每秒（KB/s），是网络流量的重要衡量标准。"
        }
    },
    "DataStorage": {
        "data_storage_disk_used_average": {
            "name": "磁盘使用率",
            "desc": "磁盘使用率，表示磁盘空间的使用情况，是衡量磁盘存储利用率的指标。"
        },
        "data_storage_disk_free_average": {
            "name": "磁盘剩余量",
            "desc": "磁盘剩余量，表示磁盘中未使用的空间量，是评估磁盘容量的关键指标。"
        },
        "data_storage_base.store_accessible": {
            "name": "存储连接状态",
            "desc": "存储连接状态，表示存储设备的可连接性，是评估存储系统健康状态的指标。"
        }
    },
    "VM": {
        "vm_cpu_usage_average_gauge": {
        "name": "CPU使用率",
        "desc": "表示系统在特定时间段内的CPU使用率，通常以百分比表示。这个指标帮助了解CPU的负载情况，以便进行性能优化和容量规划。"
        },
        "vm_cpu_usagemhz_average_gauge": {
            "name": "CPU使用量",
            "desc": "表示系统在特定时间段内的CPU使用量，通常以MHz为单位。这个指标用于衡量CPU的实际工作频率，帮助分析CPU资源的消耗情况。"
        },
        "vm_mem_usage_average_gauge": {
            "name": "内存使用率",
            "desc": "表示系统在特定时间段内的内存使用率，通常以百分比表示。这个指标帮助了解内存的负载情况，有助于优化内存使用和进行容量规划。"
        },
        "vm_mem_consumed_average_gauge": {
            "name": "活动内存",
            "desc": "表示系统在特定时间段内的活动内存，通常以MB或GB为单位。这个指标用于衡量系统实际消耗的内存资源，帮助分析内存使用情况。"
        },
        "vm_disk_io_usage_gauge": {
            "name": "磁盘I/O使用率",
            "desc": "表示虚拟机磁盘的I/O使用率，即磁盘在特定时间段内的繁忙程度。值越高，表示磁盘负载越高。"
        },
        "vm_disk_read_average_gauge": {
            "name": "磁盘读取吞吐量",
            "desc": "表示虚拟机磁盘在特定时间段内的平均读取速率。值越高，表示读取性能越好。"
        },
        "vm_disk_used_average_gauge": {
            "name": "磁盘使用率",
            "desc": "表示虚拟机磁盘的平均使用率，即磁盘已使用的空间比例。值越高，表示磁盘空间越紧张。"
        },
        "vm_disk_numberRead_summation_gauge": {
            "name": "磁盘读IO",
            "desc": "表示每秒完成的磁盘读操作次数，是衡量磁盘读请求频率的重要指标。值越高，表示磁盘读请求越频繁。"
        },
        "vm_disk_numberWrite_summation_gauge": {
            "name": "磁盘写IO",
            "desc": "表示每秒完成的磁盘写操作次数，是衡量磁盘写请求频率的重要指标。值越高，表示磁盘写请求越频繁。"
        },
        "vm_disk_write_average_gauge": {
            "name": "磁盘写入吞吐量",
            "desc": "表示虚拟机磁盘在特定时间段内的平均写入速率。值越高，表示写入性能越好。"
        },
        "vm_net_bytesRx_average_gauge": {
            "name": "网络接收速率",
            "desc": "表示系统在特定时间段内的网络接收速率，通常以MB/s或GB/s为单位。这个指标用于衡量网络的接收性能，帮助分析网络流量和带宽使用情况。"
        },
        "vm_net_bytesTx_average_gauge": {
            "name": "网络发送速率",
            "desc": "表示系统在特定时间段内的网络发送速率，通常以MB/s或GB/s为单位。这个指标用于衡量网络的发送性能，帮助分析网络流量和带宽使用情况。"
        },
        "vm_power_state_gauge": {
            "name": "电源状态",
            "desc": "表示虚拟机（VM）当前的电源状态，用于监控 VM 是处于开机还是关机状态。该指标对于监测 VM 可用性、优化资源分配和自动化运维具有重要作用。"
        }
    }
}

LANGUAGE_DICT = {
    "MONITOR_OBJECT_TYPE": MONITOR_OBJECT_TYPE,
    "MONITOR_OBJECT": MONITOR_OBJECT,
    "MONITOR_OBJECT_PLUGIN": MONITOR_OBJECT_PLUGIN,
    "MONITOR_OBJECT_METRIC_GROUP": MONITOR_OBJECT_METRIC_GROUP,
    "MONITOR_OBJECT_METRIC": MONITOR_OBJECT_METRIC,
}
